# Домашнее задание к работе 9

## Условие задачи

Составить программу, которая для заданной пользователем фигуры (два квадрата) предлагает меню выбора одной из операций:

1. Рассчитать площадь фигуры;
2. Вывести определение фигуры;
3. Нарисовать фигуру.

Для каждой операции реализовать отдельные функции:

* `float area_two_squares(float a1, float a2, float a3)` — вычисление площади;
* `void name(int a)` — вывод названия фигуры;
* `void draw_two_squares(int a1, int a2, int overlap, char symbol)` — рисование фигуры.

---

## 1. Реализация программы

```c
#include <stdio.h>


float area_two_squares(float a1, float a2, float a3) {
    return (a1 * a1) + (a2 * a2) - (a3 * a3);
}

void name(int a) {
    if (a == 4)
        printf("Фигура: два перекрывающихся квадрата.\n");
    else
        printf("Неизвестная фигура.\n");
}


void draw_two_squares(int a1, int a2, int overlap, char symbol) {
    int size = a1 + overlap; // общий размер поля
    for (int i = 0; i < size; i++) {
        for (int j = 0; j < size; j++) {
            // рисуем границы квадратов
            if ((i < a1 && j < a1) || 
                (i >= overlap && i < overlap + a2 && j >= overlap && j < overlap + a2)) {
                printf("%c ", symbol);
            } else {
                printf("  ");
            }
        }
        printf("\n");
    }
}

int main() {
    int choice;
    float a1, a2, a3;
    char symbol;

    printf("Введите сторону первого квадрата: ");
    scanf("%f", &a1);
    printf("Введите сторону второго квадрата: ");
    scanf("%f", &a2);
    printf("Введите длину перекрытия: ");
    scanf("%f", &a3);

    printf("\nМеню:\n");
    printf("1 - Рассчитать площадь фигуры\n");
    printf("2 - Вывести определение фигуры\n");
    printf("3 - Нарисовать фигуру\n");
    printf("Выберите действие: ");
    scanf("%d", &choice);

    switch (choice) {
        case 1:
            printf("Площадь фигуры: %.2f\n", area_two_squares(a1, a2, a3));
            break;
        case 2:
            name(4);
            break;
        case 3:
            printf("Введите символ для рисования: ");
            scanf(" %c", &symbol);
            draw_two_squares((int)a1, (int)a2, (int)a3, symbol);
            break;
        default:
            printf("Ошибка: неверный выбор.\n");
            break;
    }

    return 0;
}
```

---

## 2. Результаты работы программы

### Пример 1 — вычисление площади

```
Введите сторону первого квадрата: 5
Введите сторону второго квадрата: 4
Введите длину перекрытия: 2

Меню:
1 - Рассчитать площадь фигуры
2 - Вывести определение фигуры
3 - Нарисовать фигуру
Выберите действие: 1

Площадь фигуры: 37.00
```

---

### Пример 2 — определение фигуры

```
Выберите действие: 2
Фигура: два перекрывающихся квадрата.
```

---

### Пример 3 — рисование фигуры

```
Выберите действие: 3
Введите символ для рисования: *

* * * * *      
* * * * *      
* * * * * * * *
      * * * * *
      * * * * *
      * * * * *
```

---

## 3. Информация о разработчике

[Андреев Артём бТИИ-251]

